Revit 2017 API
StructuralSectionRectangular.MomentOfInertiaWeakAxis Property
 Moment of Inertia about main weak axis (I).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public double MomentOfInertiaWeakAxis { get; set; }
Visual Basic
Public Property MomentOfInertiaWeakAxis As Double
	Get
	Set
Visual C++
public:
property double MomentOfInertiaWeakAxis {
	double get ();
	void set (double value);
}
See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace